Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E26A.tmx
Source language: en_us
Languages: zh_cn

source: How to Protect Your Privacy on Public WiFi Networks
zh_cn: 使用公共WIFI时如何保护个人隐私

source: So you're at your favorite coffee shop and have hopped on to the free WiFi with your tablet to check your social networks, read the latest news, and maybe take a quick peek at your bank balance while you're enjoying your latte.
zh_cn: 在你喜爱的咖啡厅享受香浓的拿铁的时候，边使用免费WIFI刷新你的社交网络，阅读最新新闻，又或者上网瞧瞧银行账户余额。

source: We're so used to having Internet access whenever and wherever we need it that we don't often stop to consider whether logging into a public network is safe.
zh_cn: 我们习惯不分地点不分时候地使用WIFI，已经忘记要停下来想一想登录公共网络是否安全。

source: To find out just what the risks were, we consulted Con Mallon, a mobility expert with Symantec.
zh_cn: 为了查出使用公共网络的风险所在， 我们向赛门铁克的一位移动专家，康·马伦咨询。

source: "For lot of people, the first thing they do when they wander into a coffee shop or hotel lobby or the airport is to flip on their WiFi and try to find a free hotspot rather than use your own data plan or buying time from a hotspot," Mallon says.
zh_cn: 马伦提出：“当大部分人走进咖啡店，酒店大堂又或者机场时首先会使用WIFI寻找免费热点，而不是使用自己的流量套餐或者购买热点时间”。

source: There are three major ways these free, open hotspots could get you into trouble, he explains.
zh_cn: 马伦解释道：“这些免费开放的热点有三种途径会令你惹上麻烦”。

source: The risks of free WiFi
zh_cn: 免费WIFI的风险

source: Using public WiFi isn't unlike having a conversation in a public place: Others can overhear you.
zh_cn: 使用公共WIFI不像你在公共场合里谈话被别人偷听。

source: If you don't take precautions, information your devices send over a public WiFi network goes out in clear text -- and anyone else on the network could easily take a look at what you're doing with just a few simple software tools.
zh_cn: 你如果不警惕的话，手中设备的信息将通过公共WIFI网络白字黑字地公开—任何人会使用几个简单的应用软件很方便地看到你在做什么。

source: Someone spying could easily pick up your passwords or other private information.
zh_cn: 一些从事间谍活动的人可以不费吹灰之力就能盗窃你的密码或其他私人信息。

source: If you use the same password on multiple sites, that could be a big problem.
zh_cn: 如果你在多个地点上使用同一个密码，那么问题就大了。

source: Mallon reports that this is the biggest concern with public hotspots.
zh_cn: 马伦指出这就是公共热点的最大问题。

source: The next potential problem is what Mallon calls a honeypot.
zh_cn: 另外一个潜在的问题是马伦所说的甜蜜陷阱。

source: Thieves might set up their own WiFi hotspot with an unassuming name like "Public WiFi" to tempt you to connect so they can grab up any data you send.
zh_cn: 盗窃者会设置他们拥有的WIFI热点并取名如“公共WIFI”引诱你连接，然后他们就能抓取你发送的任何数据。

source: These are easy to set up without any kind of special equipment -- it could be done just using a laptop or smartphone -- so you could run into them anywhere.
zh_cn: 这很容易做得到，无需使用任何特殊设备—只需利用笔记本电脑或者智能手机—然后可以肆意侵入任何地方。

source: Mallon couldn't say just how common these honeypots are, but news reports about honeypots pop up once or twice a year.
zh_cn: 马伦说不出这些甜蜜陷阱究竟有多普遍，但是关于甜蜜陷阱的新闻报道每年都有一两条。

source: Finally, using public WiFi puts you at risk for session hijacking, in which a hacker who's monitoring your WiFi traffic attempts to take over an open session you have with an online service (like a social media site or an email client) by stealing the browser cookies the service uses to recognize who you are.
zh_cn: 最后，使用公共WIFI存在联机挟持的风险，监视你WIFI流量的黑客通过偷窃网上服务用于识别你身份的浏览器COOKIES能设法劫夺你所使用的网上服务（如社交网站或者电邮代理）。

source: Once hackers have that cookie, they can pretend to be you on these sites or even find your login and password information stored inside the cookie.
zh_cn: 一旦黑客得到了COOKIE， 他们在这些网上可以伪装成你，甚至能在COOKIE中取得你登录名和密码。

source: How to stay safe on public WiFi
zh_cn: 如何安全使用公共WIFI

source: Before you connect, be sure you know whose network you're connecting to so you don't fall prey to WiFi honeypots.
zh_cn: 在连接WIFI之前，确保你清楚明了你将连接到谁的网络，就不会堕入WIFI的甜蜜陷阱。

source: If you're not sure what the public network at a business is called, ask an employee before connecting.
zh_cn: 如果你不确定商家的公共网络叫什么，连接前请问问店员。

source: Check to make sure your computer or smartphone is not set up to automatically connect to unknown WiFi networks -- or set it to ask you before connecting -- so you're sure you know what you're connecting to when you connect.
zh_cn: 检查你的电脑或者智能手机没有设置为自动连接至陌生WIFI网络----或者设定为连接前询问是否加入网络。

source: Make sure to connect to websites via HTTPS, which encrypts anything you send and receive from the website.
zh_cn: 确保通过HTTPS连接网站，这样可以加密你所收发网站信息。

source: While a VPN service encrypts everything you send, HTTPS ensures that communication to and from a particular website is secure.
zh_cn: 当VPN加密你所有发出的信息， HTTPS能确保你与某些网站通讯安全。

source: To verify if you're connected via HTTPS, look at the address bar of your browser window; you should see "HTTPS" at the beginning of the web address (or, on some web browsers, a lock icon).
zh_cn: 要识别你是否经由HTTPS连接，就看看你的浏览器的地址栏；你可以看到在网址前的“HTTPS”（或者在某些浏览器上能见到上锁图标）。

source: To encrypt all of the data you send, use a VPN service.
zh_cn: 若要对你所发的数据加密，请使用VPN服务。

source: Anyone trying to steal your data will see only encrypted data that they can't get into.
zh_cn: 任何试图盗取你数据的人只能看到他们所不能进入的加密数据。

source: There are many services that can do this, including Witopia.net,StrongVPN.com and Norton's Hotspot Privacy.
zh_cn: 包括WITOPIA.NET, STRONGVPN.COM和NORTON’S HOTSPOT PRIVACY都可以。

source: VPN services charge a fee for their use, with pay packages ranging from day passes to year-round protection.
zh_cn: VPN服务向用户收取费用，从按天计算到包年的都有。

source: Whenever you can, use two-factor authentication, which requires both a password and a secondary code that changes regularly, for websites.
zh_cn: 你可以在任何时候登入网站时使用两步验证，两步验证要求输入密码和经常变化的验证码。

source: This makes it very difficult for hackers to get at your accounts because even if they can get your password, they won't have the secondary code.
zh_cn: 这样可以使得黑客难以侵入你的账号因为即使他们知道你的密码，他们也拿不到验证码。

source: Though not all services support it, many popular sites offer this level of security including Google, [Twitter](https://www.facebook.com/note.php?note_>Facebook, <a href=), LinkedIn, Apple andMicrosoft.
zh_cn: 尽管不是所有的服务都支持两步验证，仍有许多热门网站包括GOOGLE, TWITTER, FACEBOOK,LINKEDIN,APPLE和MICROSOFT在内有提供这项安保服务。

source: Make sure your computer isn't configured to share access to files.
zh_cn: 确保你的电脑没有设置文件共享。

source: When you're at home, it may be convenient to keep things in a folder you share with other members of the household, but that's less safe when you're connecting to public WiFi.
zh_cn: 用一个供家庭成员共享的文件夹装载文件若是在家时比较方便，但若在公共场合连接到公共WIFI就不怎么安全了。

source: Disable sharing in:
zh_cn: 关闭共享的设置：

source: Windows 8: Go to Control Panel > Network and Internet > View network status and Tasks > Change advanced sharing settings > Turn off file and printer sharing > Save changes.
zh_cn: WINDOWS 8：进入控制面板>网络和互联网>查看网络状态和任务>更改高级共享设置>关闭文件和打印机共享>保存设置。

source: Windows 7: Go to Control Panel > Network and Sharing Center > Change advanced sharing settings > Home or Work > Turn off file and printer sharing > Save changes.
zh_cn: WINDOWS 7：进入控制面板>网络与共享中心>更改高级共享设置>家庭或工作>关闭文件与打印机共享>保存更改。

source: Mac OS X: Go to System Preferences > Sharing and be sure that File Sharing doesn't have a check mark by it.
zh_cn: MAC OS X: 进入系统偏好设置>共享， 确定文件共享选项没有选中打钩。

source: Good luck, and safe browsing!
zh_cn: 祝你好运，安全浏览！
